esp8266/Arduino/libraries/ESP8266mDNS/src/LEAmDNS2Host.cpp
/*
    clsLEAmDNS2_Host::installServiceQuery (accessor)

*/
clsLEAMDNSHost::clsQuery* clsLEAMDNSHost::installServiceQuery(const char* p_pcService,
        const char* p_pcProtocol,
        clsLEAMDNSHost::clsQuery::QueryCallbackAccessorFn p_fnCallbackAccessor)
{
    clsQuery*   pQuery = nullptr;
    if ((pQuery = _installServiceQuery(p_pcService, p_pcProtocol)))
    {
        pQuery->m_fnCallbackAccessor = p_fnCallbackAccessor;
    }
    return pQuery;
}

/*
    clsLEAmDNS2_Host::installHostQuery (answer)
*/
clsLEAMDNSHost::clsQuery* clsLEAMDNSHost::installHostQuery(const char* p_pcHostName,
        clsLEAMDNSHost::clsQuery::QueryCallbackAnswerFn p_fnCallbackAnswer)
{
    clsQuery*   pQuery = nullptr;
    if ((p_pcHostName) && (*p_pcHostName))
    {
        clsRRDomain    domain;
        if ((pQuery = ((_buildDomainForHost(p_pcHostName, domain))
                       ? _installDomainQuery(domain, clsQuery::enuQueryType::Host)
                       : nullptr)))
        {
            pQuery->m_fnCallbackAnswer = p_fnCallbackAnswer;
        }
    }
    return pQuery;
}
/*
    clsLEAmDNS2_Host::installHostQuery (accessor)
*/

clsLEAMDNSHost::clsQuery* clsLEAMDNSHost::installHostQuery(const char* p_pcHostName,
        clsLEAMDNSHost::clsQuery::QueryCallbackAccessorFn p_fnCallbackAccessor)
{
    clsQuery*   pQuery = nullptr;
    if ((p_pcHostName) && (*p_pcHostName))
    {
        clsRRDomain    domain;
        if ((pQuery = ((_buildDomainForHost(p_pcHostName, domain))
                       ? _installDomainQuery(domain, clsQuery::enuQueryType::Host)
                       : nullptr)))
        {
            pQuery->m_fnCallbackAccessor = p_fnCallbackAccessor;
        }
    }
    return pQuery;
}

/*
    clsLEAmDNS2_Host::removeQuery
*/
bool clsLEAMDNSHost::removeQuery(clsLEAMDNSHost::clsQuery * p_pMDNSQuery)
{
    bool    bResult = ((p_pMDNSQuery) &&
                       (_removeQuery(p_pMDNSQuery)));
    DEBUG_EX_ERR(if (!bResult) DEBUG_OUTPUT.printf_P(PSTR("%s removeQuery: FAILED!\n"), _DH()););
    return bResult;
}

/*
    PROCESSING
*/

/*
    clsLEAmDNS2_Host::update
*/
bool clsLEAMDNSHost::update(void)
{
    if (!_updateProbeStatus())
    {
        DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("%s _updateProbeStatus: FAILED\n"), _DH()));
        return false;
    }

    if (!_checkQueryCache())
    {
        DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("%s _checkQueryCache: FAILED\n"), _DH()));
        return false;
    }

    return true;
}

/*
    clsLEAmDNS2_Host::announce
*/

bool clsLEAMDNSHost::announce(bool p_bAnnounce /*= true*/,
                              bool p_bIncludeServices /*= true*/)
{
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s ::announce() externally called\n"), _DH()););
    return _announce(p_bAnnounce, p_bIncludeServices);
}

/*
    clsLEAmDNS2_Host::announceService
*/

bool clsLEAMDNSHost::announceService(clsService * p_pService,
                                     bool p_bAnnounce /*= true*/)
{

    return _announceService(*p_pService, p_bAnnounce);
}


/*
    clsLEAmDNS2_Host::restart
*/
bool clsLEAMDNSHost::restart(void)
{
    return (_resetProbeStatus(true));   // Stop and restart probing
}


/*
    clsLEAMDNSHost_Legacy::enableArduino
*/
clsLEAMDNSHost::clsService* clsLEAMDNSHost::enableArduino(uint16_t p_u16Port,
        bool p_bAuthUpload /*= false*/)
{
    clsLEAMDNSHost::clsService* svc = addService("arduino", "arduino", "tcp", p_u16Port);
    if (svc)
    {
        if ((!svc->addServiceTxt("tcp_check", "no"))
                || (!svc->addServiceTxt("ssh_upload", "no"))
                || (!svc->addServiceTxt("board", STRINGIZE_VALUE_OF(ARDUINO_BOARD)))
                || (!svc->addServiceTxt("auth_upload", (p_bAuthUpload) ? "yes" : "no")))
        {
            removeService(svc);
            svc = nullptr;
        }
    }
    return svc;
}


/*
    P R O T E C T E D
*/

/*

    BACKBONE

*/

/*
    clsLEAmDNS2_Host::_allocBackbone

*/
UdpContext* clsLEAMDNSHost::_allocBackbone(void)
{
    UdpContext* pUDPContext = nullptr;

    if (!clsBackbone::sm_pBackbone)
    {
        // Not yet created
        clsBackbone::sm_pBackbone = new clsBackbone;
        DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s _allocBackbone: Created backbone.\n"), _DH()););

        if ((clsBackbone::sm_pBackbone) &&
                (!clsBackbone::sm_pBackbone->init()))
        {
            DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("%s _allocBackbone: FAILED to init backbone!\n"), _DH()););

            delete clsBackbone::sm_pBackbone;
            clsBackbone::sm_pBackbone = nullptr;
        }
    }
    if (clsBackbone::sm_pBackbone)
    {
        pUDPContext = clsBackbone::sm_pBackbone->addHost(this);
    }
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s _allocBackbone: %s to add host to backbone.\n"), _DH(), (pUDPContext ? "Succeeded" : "FAILED")););
    return pUDPContext;
}

/*
    clsLEAmDNS2_Host::_releaseBackbone

*/
bool clsLEAMDNSHost::_releaseBackbone(void)
{
    bool    bResult = false;

    if ((clsBackbone::sm_pBackbone) &&
            ((bResult = clsBackbone::sm_pBackbone->removeHost(this))) &&
            (0 == clsBackbone::sm_pBackbone->hostCount()))
    {
        delete clsBackbone::sm_pBackbone;
        clsBackbone::sm_pBackbone = nullptr;
        DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s _releaseBackbone: Released backbone."), _DH()););
    }
    DEBUG_EX_INFO(DEBUG_OUTPUT.printf_P(PSTR("%s _releaseBackbone: %s to remove host from backbone."), _DH(), (bResult ? "Succeeded" : "FAILED")););
    return bResult;
}


/*

    MULTICAST GROUPS

*/

/*
    clsLEAmDNS2_Host::_joinMulticastGroups
*/
bool clsLEAMDNSHost::_joinMulticastGroups(void)
{
    bool    bResult = false;

    // Join multicast group(s)
    for (netif* pNetIf = netif_list; pNetIf; pNetIf = pNetIf->next)
    {
        if (netif_is_up(pNetIf))
        {
#ifdef MDNS_IPV4_SUPPORT
            ip_addr_t   multicast_addr_V4 = DNS_MQUERY_IPV4_GROUP_INIT;
            if (!(pNetIf->flags & NETIF_FLAG_IGMP))
            {
                DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("%s _createHost: Setting flag: flags & NETIF_FLAG_IGMP\n"), _DH()););
                pNetIf->flags |= NETIF_FLAG_IGMP;

                if (ERR_OK != igmp_start(pNetIf))
                {
                    DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("%s _createHost: igmp_start FAILED!\n"), _DH()););
                }
            }

            if ((ERR_OK == igmp_joingroup_netif(pNetIf, ip_2_ip4(&multicast_addr_V4))))
            {
                bResult = true;
            }
            else
            {
                DEBUG_EX_ERR(DEBUG_OUTPUT.printf_P(PSTR("%s _createHost: igmp_joingroup_netif(" NETIFID_STR ": %s) FAILED!\n"),
                                                   _DH(), NETIFID_VAL(pNetIf), IPAddress(multicast_addr_V4).toString().c_str()););
            }
#endif

#ifdef MDNS_IPV6_SUPPORT
            ip_addr_t   multicast_addr_V6 = DNS_MQUERY_IPV6_GROUP_INIT;
            bResult = ((bResult) &&
                       (ERR_OK == mld6_joingroup_netif(pNetIf, ip_2_ip6(&multicast_addr_V6))));
            DEBUG_EX_ERR_IF(!bResult, DEBUG_OUTPUT.printf_P(PSTR("%s _createHost: mld6_joingroup_netif (" NETIFID_STR ") FAILED!\n"),
                            _DH(), NETIFID_VAL(pNetIf)));
#endif
        }
    }
    return bResult;
}

